# Ако числото е до 100 включително, бонус точките са 5;
# Ако числото е по-голямо от 100 и по-малко или равно на 1000, бонус точките са 20% от числото;
# Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
# Допълнителни бонус точки (начисляват се отделно от предходните):
# - За четно число  + 1 т.
# -     За число, което завършва на 5  + 2 т.


number = int(input())
bonus = 0

if number <= 100:
    bonus = 5
elif 100 < number <= 1000:
    bonus = number * 0.20
else:
    bonus = number * 0.10

if number % 2 == 0:
    bonus += 1
if number % 10 == 5:
    bonus += 2

print(bonus)
print(number + bonus)